<template>
  <view class="content-box">
    <view>
      本平台用户注册协议是本公司与平台用户(以下简称“您”)就平台服务相关事项所订立的有效合约，请您使用本平台服务前仔细阅读注册协议。
      <text class="blod">
        您只有完全同意所有注册协议，才能成为平台的用户（"用户"）并使用相应服务。您在注册为本平台用户过程中点击"同意用户注册协议"按钮即表示您已仔细阅读并明确同意遵守本注册协议以及经参引而并入其中的所有条款、政策以及指南，并受该等规则的约束（合称"本注册协议"）。
      </text>
    </view>
    <view>
      <text class="blod">
        本公司可能根据法律法规的要求或业务运营的需要，对本注册协议不时进行修改。除非另有规定，否则任何变更或修改将在修订内容于本平台发布之时立即生效，您对本平台的使用、继续使用将表明您接受此等变更或修改。如果您不同意本注册协议（包括本公司可能不定时对其或其中引述的其他规则所进行的任何修改）的全部规定，则请勿使用本平台提供的所有服务，或您可以主动取消本平台提供的服务。
      </text>
    </view>
    <view class="">
      为了便于您了解适用于您使用本平台的条款和条件，本公司将发布本公司对本注册协议的修改，您应不时地审阅本注册协议以及经参引而并入其中的其他规则。
    </view>
    <view class="">
      1.  用户信息采集
      <br />
      您在访问、使用本平台或申请使用本平台服务时，
      <text class="blod">
        必须提供本人真实的个人信息，且您应该根据实际变动情况及时更新个人信息。
      </text>
      保护用户隐私是本公司的重点原则，本公司通过各种技术手段和强化内部管理等办法提供隐私保护服务功能，充分保护您的个人信息安全。
    </view>
    <view class="">
      2.  用户信息管理
      <br />
      您已明确授权，为提供服务、履行协议、解决争议、保障交易安全等目的，本公司对您提供的、自行收集的及通过第三方收集的您的个人信息、您申请服务时的相关信息、您在使用服务时储存在本平台的非公开内容以及您的其他个人资料（以下简称“个人资料”）享有留存、整理加工、使用和披露的权利，具体方式包括但不限于：
      <br />
      (1)  出于为您提供服务的需要在本网站公示您的个人资料；
      <br />
      (2)  由人工或自动程序对您的个人资料进行获取、评估、整理、存储；
      <br />
      (3)  使用您的个人资料以改进本网站的设计和推广；
      <br />
      (4)  使用您提供的联系方式与您联络并向您传递有关服务和管理方面的信息； 
      <br />
      (5)  对您的个人资料进行分析整合并向为您提供服务的第三方提供为完成该项服务必要的信息。当为您提供服务的第三方与您电话核实信息时，为保证为您服务的质量，你同意本平台对上述核实电话进行录音；
      <br />
      (6)  在您违反与本公司或本公司的其他用户签订的协议时，披露您的个人资料及违约事实，将您的违约信息写入黑名单并与必要的第三方共享数据，以供本公司及第三方审核、追索之用；
    </view>
    <view class="">
      3.  用户管理
      <br />
      您可以在任何时候通过使用您的本平台的注册用户名和密码，查询，补充或更正您的本平台帐户中的个人信息，或要求删除您的本平台帐户中的个人信息。您在平台的帐户可以被删除，但这样会导致您不能够登录本网站/软件及使用本网站/软件的任何服务。若发现任何非法使用用户帐号或存在安全漏洞的情况,请立即通知本站并向公安机关报案。因用户未妥善保管其帐号名称及密码而导致第三人使用帐号而给用户造成的损失,由用户自行承担。
      <br />
      用户在注册及使用时应承诺遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性等七条底线,且用户对其发布的内容(包括但不限于文字、图片等)时,不得有以下情形：
      <br />
      (1)违反宪法或法律法规规定的；
      <br />
      (2)危害国家安全,泄露国家秘密,颠覆国家政权,破坏国家统一的；
      <br />
      (3)损害国家荣誉和利益的,损害公共利益的；
      <br />
      (4)煽动民族仇恨、民族歧视,破坏民族团结的；
      <br />
      (5)破坏国家宗教政策,宣扬邪教和封建迷信的；
      <br />
      (6)散布谣言,扰乱社会秩序,破坏社会稳定的；
      <br />
      (7)散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
      <br />
      (8)侮辱或者诽谤他人,侵害他人合法权益的；
      <br />
      (9)含有法律、行政法规禁止的其他内容。
      <br />
      用户以虚假信息骗取帐号名称注册,或其帐号头像、简介等注册信息存在违法和不良信息的,本平台有权采取通知限期改正、暂停使用、注销登记等措施。注册帐号仅限于用户本人使用,严禁将您的帐号允许第三人使用,否则用户应承担由此产生的全部责任,并与实际使用人承担连带责任。
    </view>
    <view class="">
      4.  用户隐私制度
      <br />
      我们会在您自愿的前提下收集您的个人信息并将这些信息进行整合,包括但不限于注册
      帐号时的相关信息和活动报名信息等。
      <text class="blod">
        尊重用户个人隐私是本平台的一项基本政策，所以本公司不会公开或向任何第三方透露用户的注册资料以及用户因享受本平台服务而提供的任何信息,但以下情形除外:
        <br />
        (1)  事先获得用户的明确授权或许可；
        <br />
        (2)  遵守有关法律规定,包括在国家有关机关查询时,提供用户的注册信息、用户在本站发布的信息内容及其发布时间、互联网地址或者域名等；
        <br />
        (3)  在紧急情况下竭力维护用户个人和社会大众的隐私安全；
        <br />
        (4)  根据本条款相关规定或者本平台认为必要的其他情形，本平台可能会与第三方合作向用户提供相关的网络服务,在此情况下,如该第三方同意承担与本平台同等的保护用户隐私的责任,则本平台可将用户信息提供给该第三方。
      </text>
    </view>
    <view class="">
      5.  协议更新及用户关注义务
      <br />
      根据国家法律法规的更新及网站运营需要,我们有权对本条款不时地进行修改,修改后的服务条款一旦被张贴在本站上即生效力,并代替原来的服务条款。用户可随时登录查阅最新服务。
      <br />
      如用户不同意更新后的服务条款,应立即停止接受本站提供的服务;如用户继续使用本站提供的服务,即视为同意更新后的用户协议。我们建议您在使用本站之前阅读本用户
      <br />
      协议及本站的公告。如果本用户协议中任何一条被视为废止无效或因任何理由不可执行,该条应视为可分的且并不影响任何其余协议的有效性和可执行性。
    </view>
    <view class="">
      6.  免责声明
      <br />
      <text class="blod">
        本平台是一个开放平台，用户将文章或照片等个人资料上传到互联网上，有可能会被其他组织或个人复制、转载、擅改或做其它非法用途，用户必须充分意识此类风险的存在。作为网络服务的提供者，本公司对用户在任何论坛、个人主页或其它互动区域提供的任何陈述、声明或内容均不承担责任。
      </text>
      <br />
      您明确同意使用本平台服务所存在的风险或产生的一切后果将完全由您自身承担，本公司对上述风险或后果不承担任何责任。
      <br />
      您违反本注册协议、违反道德或法律的，侵犯他人权利（包括但不限于知识产权）的，本公司不承担任何责任。同时，本公司对任何第三方通过本平台发送服务或包含在服务中的任何内容不承担责任。
      <br />
      (1)  对您、其他用户或任何第三方发布、存储或上传的任何内容或由该等内容导致的任何损失或损害，本公司不承担责任。
      <br />
      (2)  对任何第三方通过本平台可能对您造成的任何错误、中伤、诽谤、诬蔑、不作为、谬误、淫秽、色情或亵渎，本公司不承担责任。
      <br />
       
      (3)  对黑客行为、计算机病毒、或因您保管疏忽致使帐号、密码被他人非法使用、盗用、篡改的或丢失，或由于与本网站链接的其它网站所造成您个人资料的泄露，本公司不承担责任。
      <br />
      (4)  如您发现任何非法使用用户帐号或安全漏洞的情况，请立即与本公司联系。因任何非本平台原因造成的网络服务中断或其他缺陷，本公司不承担任何责任。
      <br />
      (5)  本公司不保证服务一定能满足您的要求；不保证服务不会中断，也不保证服务的及时性、安全性、准确性。
      <br />
      (6)  任何情况下，因使用本平台而引起或与使用本平台有关的而产生的由本公司负担的责任总额，无论是基于合同、保证、侵权、产品责任、严格责任或其它理论，均不得超过您因访问或使用本网站而向本平台支付的任何报酬（如果有的话）。
      <br />
      (7)  本平台提供免费的贷款推荐服务和推荐信用卡办卡服务，贷款、办信用卡过程中遇到的任何预先收费均为诈骗行为，请保持警惕避免损失。
    </view>
    <view class="">
      7.  法律管辖和适用
      <br />
      本用户协议的订立、执行和解释及争议的解决均应适用在中华人民共和国大陆地区现行之有效法律。如发生本服务条款的某些内容与适用之法律相抵触时,则这些条款将完全按法律规定重新解释,而其它有效条款继续有效。如缔约方就本条款內容或其执行发生任何争议,双方应尽力友好协商解决;协商不成时,任何一方均可向所在地的中华人民共和国大陆地区法院提起诉讼。
    </view>
    <view class="">
      8.  其他
      <br />
      我们尊重用户和消费者的合法权利,本用户协议及本站上发布的各类规则、政策、声明等其他内容,均是为了更好的、更加便利的为用户和消费者提供服务。本平台欢迎用户和社会各界提出意见和建议,我们将虚心接受并适时修改本服务条款及相关政策、规则。
      <br />
      您完成注册且成为本平台的注册用户则意味着您完全接受本用户协议,在注册之前请您再次确认已知悉并完全理解本用户协议的全部内容。
    </view>
  </view>
</template>
<style scoped lang="scss">
  .content-box{
      width: 750rpx;
      height: auto;
      padding:20rpx;
      font-size: 20rpx;
      .blod{
        font-weight:bold;
      }
  }
</style>
